{
    "endReached":"You have reached the end of this section!",
    "continueToNext":"Continue to the next section:",
    "rememberToCheckPoints":"Remember to check your points from the ball on the bottom-right corner of the material!",
    "footer-src":"Source code of the material",
    "makers":"This course is created by the Agile Education Research -research group",
    "rage":"of the University of Helsinki",
    "credits":"Credits and about the material",
    "twitter-aria":"Mooc.fi Twitter -profile",
    "facebook-aria":"Mooc.fi Facebook -profile",
    "yourube-aria":"Mooc.fi YouTube -channel",
    "logout":"Log out",
    "newAccount":"Create new account",
    "login":"Log in",
    "mailingListTitle":"Remind me when the course starts",
    "subscribe":"subscribe",
    "tableOfContents":"Table of contents",
    "sampleOutput":"Sample output",
    "sampleData":"Sample data",
    "loginToSeeExercise":"Login to view the exercise",
    "pleaseLogin":"You are not logged in. Some parts of the material are only for logged in users. You can log in here: ",
    "inThisSection":"In this part:" ,
    "programmingExercise":"Programming exercise:",
    "points":"Points",
    "submitNB":"NB! By submitting a solution to a  part of an exercise which has multiple parts, you can get part of the exercise points. You can submit a part by using the 'submit' button on NetBeans. More on the programming exercise submission instructions: ",
    "submitHowTo":"Exercise submission instructions",
    "loginForExercise":"Log in to see the exercise",
    "submitNetBeans":"Submit your solution to be checked on the server on the NetBeans programming environment: ",
    "seeSubmissions":"You can see your submissions in the Test My Code exercise submission environment.",
    "here":"here",
    "solutionHowTo":"How to see the solution",
    "noCoin":"In this exercise you cannot use a coin to see the solution before submitting the exercise.",
    "whyCoin":"You can see the solution either before or after submitting the exercise. If you want to see the solution before submitting the exercise you have to use solutioncoins.",
    "getNewCoin":"You will get a new solutioncoin when you have submitted",
    "getNewCoin2":"exercises. You can use coins to see exercise solutions and get yourself out of a pickle.",
    "oneCoin":"You have 1 coin",
    "howManyCoins":"You have <1>{{count}}</1> coins.",
    "nocoins":"You don't have any coins yet.",
    "howCoins":"You only use a coin when you click the button which says 'uses a coin' under this text. You can see the solution without using a coin  in the Test My Code -service  either in Netbeans or in TMC website after submitting the exercise.",
    "seeSolution":"View solution",
    "usesCoin":"Uses a coin",
    "coinUsed":"You have already used a coin for this solution",
    "update":"Update",
    "solution":"Solution",
    "exerciseList":"List of exercises in this part",
    "unknownType":"Unknown exerise type",
    "quiz":"Quizz",
    "loading":"Loading a part...",
    "loginToSee":"There is some content here which is visible only for logged in users. Log in to see the content.",
    "errorInMaterial":"Cannot load a part due to an error: ",
    "incorrectMaterial":"There is some incorrectly defined content here. Reason: no id."


}
